; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v4)
             (pred_11 ?v6 ?v10)
             (pred_12 ?v11 ?v10)
             (pred_4 ?v12 ?v11 )
	     (pred_6 ?v11)
             (pred_5 ?v13)
             (pred_10 ?v6)
             (pred_9 ?v10)
             (pred_2 ?v11)
             (pred_7 ?v6)
             (pred_3 ?v11)
             (pred_8 ))



(:action op_1
:parameters (?v2 ?v5 ?v3 ?v9)
:precondition (and (pred_5 ?v2) (pred_5 ?v5) (pred_10 ?v3) (pred_9 ?v9)
          (pred_1 ?v2 ?v5) (pred_11 ?v3 ?v9)
                   (pred_12 ?v5 ?v9) (pred_6 ?v2) 
                   (pred_2 ?v5) (pred_7 ?v3))
:effect (and  (pred_3 ?v5) (not (pred_2 ?v5))))


(:action op_4
:parameters (?v2 ?v8)
:precondition (and (pred_5 ?v2) (pred_5 ?v8)
               (pred_6 ?v2) (pred_1 ?v2 ?v8) (pred_3 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v2))))

(:action op_5
:parameters (?v2 ?v3)
:precondition (and (pred_5 ?v2) (pred_10 ?v3) 
                  (pred_6 ?v2) (pred_4 ?v3 ?v2) (pred_8 ))
:effect (and (pred_7 ?v3)
   (not (pred_4 ?v3 ?v2)) (not (pred_8 ))))


(:action op_3
:parameters (?v2 ?v7 ?v1)
:precondition (and (pred_5 ?v2) (pred_10 ?v7) (pred_10 ?v1)
                  (pred_6 ?v2) (pred_7 ?v1) (pred_4 ?v7 ?v2))
:effect (and (pred_7 ?v7) (pred_4 ?v1 ?v2)
        (not (pred_7 ?v1)) (not (pred_4 ?v7 ?v2))))

(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_5 ?v2) (pred_10 ?v3) 
                  (pred_6 ?v2) (pred_7 ?v3))
:effect (and (pred_8 ) (pred_4 ?v3 ?v2) (not (pred_7 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_08 obj_13 obj_11 obj_02 obj_12 obj_09 obj_06 obj_07
    obj_05 obj_01
    obj_10 obj_03
    )

    (:init
       (pred_8)

       (pred_5 obj_04)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_02)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_06)
       (pred_5 obj_07)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_03)

       (pred_1 obj_04 obj_11)
       (pred_1 obj_04 obj_08)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_04)
       (pred_1 obj_13 obj_12)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_04)
       (pred_1 obj_02 obj_06)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_13)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_06 obj_02)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_04)
       (pred_12  obj_11 obj_05)
       (pred_12  obj_04 obj_01)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_3 obj_12)
       (pred_3 obj_09)
       (pred_3 obj_06)
       (pred_3 obj_07)

       (pred_11  obj_10 obj_05)
       (pred_11  obj_03 obj_01)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_03 obj_09)
       (pred_6 obj_09)
    )

    (:goal (and
       (pred_4 obj_10 obj_07)
    ))
(:constraints
  (always (not (pred_6 obj_12)))
)
)

; plan
1. (op_4 obj_09 obj_06)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_02)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_02)
   goals met: 0 of 1
3. (op_5 obj_02 obj_10)
   deleted: (pred_4 obj_10 obj_02) (pred_8)
   added: (pred_7 obj_10)
   goals met: 0 of 1
4. (op_4 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_06)
   goals met: 0 of 1
5. (op_4 obj_06 obj_07)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_07)
   goals met: 0 of 1
6. (op_2 obj_07 obj_10)
   deleted: (pred_7 obj_10)
   added: (pred_8) (pred_4 obj_10 obj_07)
   goals met: 1 of 1
